# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [40]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [41]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

In [42]:
df = pd.read_csv(url, '\t')

### Step 4. See the first 10 entries

In [43]:
df.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 5. What is the number of observations in the dataset?

In [44]:
# Solution 1
print("There are {} rows".format(df.shape[0]))

There are 4622 rows

In [45]:
# Solution 2

print("There are {} rows".format(len(df.index)))

There are 4622 rows

### Step 6. What is the number of columns in the dataset?

In [46]:
print("There are {} columms".format(df.shape[1]))

There are 5 columms

### Step 7. Print the name of all the columns.

In [47]:
for x in df.columns:
    print (x)

order_id
quantity
item_name
choice_description
item_price

### Step 8. How is the dataset indexed?

In [48]:
df.index

RangeIndex(start=0, stop=4622, step=1)

### Step 9. Which was the most-ordered item?

In [49]:
grouped = df.groupby(['item_name']).agg({'quantity': 'sum'})
grouped.sort_values('quantity', ascending = False)[:5]

                     quantity
item_name
Chicken Bowl              761
Chicken Burrito           591
Chips and Guacamole       506
Steak Burrito             386
Canned Soft Drink         351

In [50]:
grouped = df.groupby(['item_name']).agg({'quantity':'sum'})
grouped.sort_values('quantity', ascending = False)[:5]

                     quantity
item_name
Chicken Bowl              761
Chicken Burrito           591
Chips and Guacamole       506
Steak Burrito             386
Canned Soft Drink         351

### Step 10. For the most-ordered item, how many items were ordered?

In [51]:
grouped = df.groupby(['item_name']).agg({'quantity':'sum'})
grouped.sort_values('quantity', ascending = False)[:1]

#76 items 761 items were ordered

              quantity
item_name
Chicken Bowl       761

### Step 11. What was the most ordered item in the choice_description column?

In [52]:
grouped_desc = df.groupby(['choice_description']).agg({'quantity':'sum'})
grouped_desc.sort_values('quantity', ascending = False)[:1]

#Diet coke was the most

                    quantity
choice_description
[Diet Coke]              159

### Step 12. How many items were orderd in total?

In [53]:
total_ordered_items = df['quantity'].sum()
print("A total of {} were ordered".format(total_ordered_items))

A total of 4972 were ordered

### Step 13. Turn the item price into a float

#### Step 13.a. Check the item price type

In [54]:
df['item_price'].dtype

x = df['item_price'].str.slice(1).astype(float)

print(x)

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

#### Step 13.b. Create a lambda function and change the type of item price

In [55]:
df['item_price'] = df.item_price.apply(lambda x: float(x[1:]))

#### Step 13.c. Check the item price type

In [56]:
df['item_price'].dtype

dtype('float64')

### Step 14. How much was the revenue for the period in the dataset?

In [57]:
print("The revenue for the period in the dataset was ${}".format(df['item_price'].sum()))

The revenue for the period in the dataset was $34500.16

### Step 15. How many orders were made in the period?

In [58]:
print("A total of {} orders were made in the period".format(df['order_id'].nunique()))

A total of 1834 orders were made in the period

### Step 16. What is the average revenue amount per order?

In [59]:
# Solution 1

df.groupby(['order_id']).sum()

          quantity  item_price
order_id
1                4       11.56
2                2       16.98
3                2       12.67
4                2       21.00
5                2       13.70
...            ...         ...
1830             2       23.00
1831             3       12.90
1832             2       13.20
1833             2       23.50
1834             3       28.75

[1834 rows x 2 columns]

### Step 17. How many different items are sold?

In [66]:
print("The numbner of different items that are sold are {}.".format(df['item_name'].nunique()))

The numbner of different items that are sold are 50.